In [10]:
import pandas as pd

In [9]:
df = pd.read_csv(r'C:\Users\Lenovo\OneDrive\Documents\Sample4.csv',
                index_col = ['RollNo'])
df.head()

       Section Branch  Physics  Chemistry  Math  Comp         DOB
RollNo
1            A   Comp       42         68    20    81  01-01-2003
2            C   Mech       43         69    21    82  02-01-2003
3            B     IT       44         70    22    83  03-01-2003
4            D   E&TC       45         71    23    84  04-01-2003
5            A   Chem       46         72    24    85  05-01-2003

In [11]:
df.loc[1]

Section               A
Branch             Comp
Physics              42
Chemistry            68
Math                 20
Comp                 81
DOB          01-01-2003
Name: 1, dtype: object

In [12]:
df.loc[5]

Section               A
Branch             Chem
Physics              46
Chemistry            72
Math                 24
Comp                 85
DOB          05-01-2003
Name: 5, dtype: object

In [13]:
df.loc[[5,6,7,8]]

       Section Branch  Physics  Chemistry  Math  Comp         DOB
RollNo
5            A   Chem       46         72    24    85  05-01-2003
6            A  Civil       47         73    25    86  06-01-2003
7            C  Civil       48         74    26    87  07-01-2003
8            B   Comp       49         75    27    88  08-01-2003

In [14]:
df.loc[5, 'Physics']

np.int64(46)

In [15]:
df.loc[5:10, 'Chemistry']

RollNo
5     72
6     73
7     74
8     75
9     76
10    77
Name: Chemistry, dtype: int64

In [16]:
df.loc[df['Physics']>50]

       Section Branch  Physics  Chemistry  Math  Comp         DOB
RollNo
10           C  Civil       51         77    29    90  10-01-2003
11           D     IT       52         78    30    91  11-01-2003
12           A    A&R       53         79    31    92  12-01-2003
13           B   Chem       54         80    32    93  13-01-2003
14           C   E&TC       55         81    33    94  14-01-2003
15           D    E&C       56         82    34    95  15-01-2003

In [17]:
df.loc[df['Physics']>50, ['Math']]

        Math
RollNo
10        29
11        30
12        31
13        32
14        33
15        34

In [20]:
df.iloc[0]

Section               A
Branch             Comp
Physics              42
Chemistry            68
Math                 20
Comp                 81
DOB          01-01-2003
Name: 1, dtype: object

In [21]:
df.iloc[[0]]

       Section Branch  Physics  Chemistry  Math  Comp         DOB
RollNo
1            A   Comp       42         68    20    81  01-01-2003

In [22]:
df.iloc[:,0]

RollNo
1     A
2     C
3     B
4     D
5     A
6     A
7     C
8     B
9     D
10    C
11    D
12    A
13    B
14    C
15    D
Name: Section, dtype: object

In [23]:
df.iloc[:,1]

RollNo
1      Comp
2      Mech
3        IT
4      E&TC
5      Chem
6     Civil
7     Civil
8      Comp
9      Mech
10    Civil
11       IT
12      A&R
13     Chem
14     E&TC
15      E&C
Name: Branch, dtype: object

In [27]:
df.iloc[0:5, 1:4]

       Branch  Physics  Chemistry
RollNo
1        Comp       42         68
2        Mech       43         69
3          IT       44         70
4        E&TC       45         71
5        Chem       46         72